fn-manual.tex


\subsubsection{Lists}
\label{sec:org73f773f}

Lists in Fn are what you'd expect for a functional programming language. They're
created using square brackets or by using the \texttt{List} function.

\begin{verbatim}
[] ; empty list
['a 'b] ; list of two symbols
[1 'a "str"] ; lists may contain objects of arbitrary type

;; List is identical to square bracket syntax
[1 2 3]
(List 1 2 3)
\end{verbatim}

Lists can be manipulated with builtin functions:

\begin{verbatim}
(def list1 [["str" 2] 'a 'b])
(def list2 [0 2 4 6 8 10])

;; head and tail access the head and tail of the list
(head list1) ;=> ["str" 2]
(head list2) ;=> 0
(tail list1) ;=> ['a 'b]

(tail [])    ;=> []
(head [])    ;=> error (empty list has no head)

;; nth allows random access:
(nth list1 2) ;=> 'b
(nth list2 1) ;=> 2

;; length gives the length of a list
(length []) ;=> 0
(length list1) ;=> 3
(length list2) ;=> 6

;; cons prepends elements
(cons 2 []) ;=> [2]
(cons nil list1) ;=> [nil ["str" 2] 'a 'b]

;; concat concatenates two or more lists
(concat [1 2 3] [4 5 6]) ;=> [1 2 3 4 5 6]
(concat [37] ['foo] ["bar"]) ;=> [37 'foo "bar"]
(concat list2 list1) ;=> [0 2 4 6 8 10 ["str" 2] 'a 'b]

;; reverse reverse the direction of a list
(reverse list2) => [10 8 6 4 2 0]
\end{verbatim}


\subsubsection{Tables}
\label{sec:org85de6b3}

Tables are key-value stores. Any type of object may be used as a key or a value,
(note, however, that it takes longer to hash more complicated data structures
since we have to descend on their fields)\footnote{Two keys are equal if \texttt{(= k1 k2)} is true (using the builtin
equality function). For simple data types the meaning of equality is obvious.
Lists and tables are compared componentwise. That is, two lists are equal if and
only if all their respective entries are equal. Two tables are equal if their
key sets are equal (disregarding order), and for each key the corresponding
values in each table are equal.}.

Tables are built using braces \texttt{\{\}} or the equivalent \texttt{Table} function. This must be
passed an even number of arguments.

\begin{verbatim}
{} ;=> empty table
{'key1 4 'key 6} ;=> table with two kv-pairs
(Table 'key1 4 'key 6) ;=> table with two kv-pairs
\end{verbatim}

Table elements may be accessed using the builtin function \texttt{get}. When the key is a
constant symbol, dot syntax (or the equivalent \texttt{dot} special operator) can be
used instead. This is how this looks:

\begin{verbatim}
(def tab1 {'name "Mr. Table"
          'occupation "Holds data"
          'child {'name "Table Jr." 
                  'occupation "Holds less data"}})
(def tab2 {0 'zero 1 'one 2 'two 3 'three 4 'four})

;; these all return "Mr. Table"
(get tab1 'name)
tab1.name
(dot tab1 name) ; equivalent syntax to the dot expression
;; Note that the symbols in the dot expressions are unquoted. Arguments to dot 
;; must be unquoted symbols or a compilation error occurs.

;; get is more flexible than dot and allows arbitrary key and value expressions
(get tab2 (+ 1 2)) ;=> 'three
(get {'k 'v} 'k) ;=> 'v

;; dot makes it convenient to descend on tables with symbolic key names
tab1.child.name ;=> "Table Jr."
;; equivalent expression:
(dot tab1 child name)
\end{verbatim}

Since tables are mutable, the main way to populate them is to use the \texttt{set!}
operator (the same one as for local variables). In this case, the first argument
may be any legal \texttt{get} or \texttt{dot} expression on a table.

Lastly, tables size can be checked with \texttt{length}, a list of keys can be retrieved
with \texttt{table-keys}, and two or more tables can be combined with \texttt{concat} (if any of
the tables have keys in common, the last table in the argument list takes
priority).


\subsubsection{Quoting}
\label{sec:orgef30853}

"Quoting" refers to the process of converting Fn source code into native Fn
data. This allows us to easily process and manipulate Fn source code using the
same facilities as for normal data.

Quoting is the secret sauce that makes Fn's macro system work. It's the main
reason why Fn has the syntax it has.

The \texttt{quote} special operator has syntax:
\begin{verbatim}
(quote <expr>) ;; or, equivalently
'<expr>
\end{verbatim}
where \texttt{<expr>} can be any expression (in fact, it need not be a legal expression
by itself). These two notations are exactly the same. The interpreter expands
the second into the first before evaluation.

The value returned by quote is guaranteed to only consist of lists, symbols,
numbers, and strings. We refer to the latter three as \textbf{atoms}. Here are some
examples:
\begin{verbatim}
'(a b c) ;; returns ['a 'b 'c]
'"string" ;; returns "string"
'(+ a (/ x 2)) ;; returns ['+ 'a ['/ 'x 2]]

''quot ;; is equivalent to
(quote (quote quot)) ;; which returns ['quote 'quot]
\end{verbatim}

Note that \texttt{<expr>} only needs to be syntactically valid (i.e. not freak out the
parser). Illegal expressions can be quoted just fine:
\begin{verbatim}
'() ;; returns [] (the empty list)
'(2 (3 4)) ;; returns [2 [3 4]]
'(quote) ;; returns ['quote]
\end{verbatim}

This makes \texttt{quote} very handy for creating nested lists of atoms. (\texttt{quote} also has
a big sister named \texttt{quasiquote}, which is covered in the section on macros, and
allows for much more flexibility).

\texttt{quote} is also the primary way to create symbols. As noted in subsection \ref{sec:orgd68ab38}, this can lead to problems when we want a symbol whose name is a
syntactically valid number. Adding an escape character to the symbol name
designates to the parser that the token should be read as a symbol rather than a
number. In fact, we can even use this trick to give variables numbers for names:
\begin{verbatim}
;; probably don't do this
(def \2 3)
2  ;; returns 2
\2 ;; returns 3
\end{verbatim}

My recommendation: just don't use symbol names that are syntactically legal
numbers.


\subsection{{\bfseries\sffamily TODO} Control Flow and Functions}
\label{sec:org679c46d}

\subsubsection{Conditional Execution}
\label{sec:orgb1b9cca}

The conditional control flow primitives are \texttt{if} and \texttt{cond}.

\texttt{if} takes exactly three arguments: a test expression, an expression to evaluate
if the test is true, and an expression to evaluate if the test is false. In Fn,
\texttt{nil} and \texttt{false} are considered to be false values, while all others are treated as
\texttt{true}.
\begin{verbatim}
;; if and cond syntax

;; cond takes pairs of expressions and consequences
(cond
  false 1
  nil   2
  'foo  3
  true  4)
; => returns 3, because 'foo is the first true value

(defn fizzbuzz (x)
  (cond
    (= (mod x 15) 0) 'FizzBuzz
    (= (mod x 5) 0)  'Buzz
    (= (mod x 3) 0)  'Fizz
    true             x))
(fizzbuzz 6)  ; = Fizz
(fizzbuzz 7)  ; = 7
(fizzbuzz 45) ; = FizzBuzz
(fizzbuzz 65) ; = Buzz
\end{verbatim}

\texttt{cond} is an alternative conditional syntax which is analogous to "if/else if"
blocks in other programming languages. \texttt{cond} takes pairs of arguments and treats
the first one as a test. If the test is true, it returns the result of the
second argument in the pair. Otherwise it proceeds to the next pair, returning
\texttt{nil} if the end is reached.
