fn-manual.tex


\subsubsection{Creating Functions}
\label{sec:orgd6347d1}

Functions are created using \texttt{fn}.

A short syntax is also provided for creating functions via the dollar sign,
which expands into a \texttt{dollar-fn} special form.

For example:
\begin{verbatim}
(fn (x) (* x x))
$(* $ $)
(dollar-fn (* $ $))
\end{verbatim}

All three of the above take in a single argument and square it. Note that
dollar-fn uses \texttt{\$} (or equivalently, \texttt{\$0}) for the name of the first parameter.
(Other positional parameters can be accessed with \texttt{\$1}, \texttt{\$2}, and so on). See
subsection \ref{sec:org8e5416c} for more details.

\texttt{fn} on the other hand has an explicit parameter list. The syntax for parameter
lists is this:
\begin{verbatim}
param-list      ::=  '(' <req-param>* <opt-param>* <var-params>? ')'
req-param       ::= <identifier>
opt-param       ::= (<identifier> <init-form>)
var-params      ::= <var-list-param> <var-table-param>?
                  | <var-table-param> <var-list-param>?
var-list-param  ::= '&' <identifier>
var-table-param ::= ':&' <identifier>
\end{verbatim}

In other words, parameter lists consist of zero or more required parameters,
zero or more optional parameters, and optionally end with variadic table and
list arguments.

Each of these parameters has an associated identifier (i.e. a symbol that is a
legal name). In the function's body, the respective arguments are bound to these
names. See subsection \ref{sec:orgc5c7f45} for information about how argument lists
are processed during function calls.


\subsubsection{Function Calls}
\label{sec:orgc5c7f45}

Fn allows arguments to be named in function calls very similarly to Python.
Named arguments are passed using keywords, which are simply symbols whose names
begin with \texttt{:}. These symbols are not legal identifiers, so their appearance in
function calls is unambiguous. We also place the restriction that positional
arguments may not follow named ones. (Believe me, I tried to make it work
without that, and it's a mess at every level).

First we will deal with the case where there are no variadic parameters. See the
following example.
\begin{verbatim}
;; this function has 3 positional parameters, the last of which is optional
(defn arg-demo (x y (z 2))
  (* z (+ x y)))

;; here are a couple of ways we could call this function
(arg-demo 2 3)            ; x = 2, y = 3, z = 2, result = 10
(arg-demo 2 3 4)          ; x = 2, y = 3, z = 4, result = 20
(arg-demo :x 2 :y 3)      ; x = 2, y = 3, z = 2, result = 10
(arg-demo :z 2 :y 3 :x 2) ; x = 2, y = 3, z = 2, result = 10
(arg-demo :z 3 1 2)       ; error! positional argument following named argument
\end{verbatim}

To be precise, function parameters (still considering the case where there are
no variadic parameters) are bound using the following procedure:
\begin{itemize}
\item the unnamed arguments are bound to positional parameters in order
\item the named arguments are bound to their respective parameters, raising an error
if any duplicates or unrecognized names are found
\item unbound optional parameters are set to their default values. If any required
parameters remain unbound, an error is raised
\end{itemize}

Now, variadic arguments change some of the rules. We have two types of variadic
parameters in Fn: variadic tables, and variadic lists.

For tables, the semantics are very simple. Functions with a variadic table
parameter can accept any named argument, not just the names corresponding to
their functions (duplicated names are still not allowed). Moreover, it's now
possible for a named argument to have the same name as a positional argument.
\begin{verbatim}
;; demo function ignores first arg and returns table
(def var-tab-demo ((x nil) :& tab) ; variadic table arguments denoted with :&
  tab)

(var-tab-demo 0)         ; result = {}
(var-tab-demo :y 2 :x 1) ; result = {'y 1}
(var-tab-demo 1 :x 2)    ; result = {'x 2}
\end{verbatim}

As can be seen above, the variadic table is constructed by taking all
unrecognized named arguments and inserting them into the table as key-value
pairs. Moreover, if a named argument is recognized, but was already provided as
a positional argument, then that goes to the variadic table as well.

Variadic lists are analogous to variadic tables, but where those act on trailing
named arguments, variadic lists act on trailing positional arguments. As such,
it is impossible to use named arguments while at the same time passing a
non-empty variadic list argument, except in the case where there is also a
variadic table parameter to catch the trailing arguments.
\begin{verbatim}
;; demo function ignores first arg and returns list
(def var-lst-demo (x & list) ; variadic lists denoted with &
  list)

(var-lst-demo 0 1 2)  ;=> [1 2]
(var-lst-demo 0)      ;=> []
(var-lst-demo 0 :x 2) ;=> syntax error
(var-lst-demo :x 0)   ;=> []
(var-lst-demo :x 0 1) ;=> syntax error

;; demo function using both variadic parameters
(def var-mixed-demo (x & list :& table)
  [list table])

;; names not explicitly in the parameter list get sent to the variadic table
(var-mixed-demo :x 4 :y 2) ;=> [[] {'y 2}]
;; with a variadic table argument, duplicate names are allowed if one is a 
;; positional arg:
(var-mixed-demo 'a 'b :x 4 :y 2) ;=> [['b] {'x 4 'y 2}]
;; as always, keywords cannot precede positional arguments
(var-mixed-demo :x 4 :y 2 'a 'b) ;=> syntax error
\end{verbatim}


\subsubsection{{\bfseries\sffamily TODO} Variable Capture}
\label{sec:org5f73b62}


\subsubsection{{\bfseries\sffamily TODO} dollar-fn}
\label{sec:org8e5416c}


\subsection{{\bfseries\sffamily TODO} Namespaces and Import}
\label{sec:org3eb67b4}

\subsubsection{Namespaces and Packages}
\label{sec:org8fdf53d}

A namespace is a collection of global variables and macros. They are identified
by a name which is required to be globally unique. All Fn code lives inside of
some namespace.

Some examples of namespace names are:
\begin{verbatim}
fn/builtin
fn/repl
project/main
project/subsystem/parser
\end{verbatim}

The slashes above are delimiters. In particular, everything to the left of the
last slash is called the \textbf{package name}, and the part to the right is called the
\textbf{short name}. For instance the namespace \texttt{project/subsystem/parser} has package
\texttt{project/subsystem} and short name \texttt{parser}.

We also have the concept of a \textbf{subpackage}. In the above examples,
\texttt{project/subsystem} is a subpackage of \texttt{project}. That is, the subpackages of a
\texttt{<pkg>} are all packages with names of the form \texttt{<pkg>/...}.


\subsubsection{Namespace Determination}
\label{sec:orgf0cd9c9}

When a file is interpreted, the short name of the namespace is set to the stem
of the filename. There is no way to change this. The package, however, may be
anything at all, and is specified by putting a \texttt{package} declaration at the top of
the file:

\begin{verbatim}
(package myproject/util)
\end{verbatim}

If no package declaration is present, the package \texttt{fn/user} is used by default.

Unlike other special forms in Fn, there can only be one package declaration per
file, and it must come at the beginning of the file, although it can be
preceeded by comments and whitespace.

The REPL allows the current namespace to be changed interactively. By default it
uses the namespace \texttt{fn/repl}.


\subsubsection{Importing Namespaces}
\label{sec:org532b7e4}

Importing a namespace means taking its bindings into the current namespace.


\subsubsection{Builtin Namespace}
\label{sec:org3370284}

When a new namespace is created, an unqualified import of \texttt{fn/builtin} is
automatically performed.


\subsubsection{Global Names}
\label{sec:orgb090073}

After a namespace has been imported once, its bindings can be referenced even
without importing it explicitly. This is done by using symbols whose names are
structured like with \texttt{/<namespace>:<symbol>}. For example, \texttt{/fn/builtin:map}
refers to the function \texttt{map} in the \texttt{fn/builtin} namespace.


\subsection{{\bfseries\sffamily TODO} Macros}
\label{sec:orgbcf79c6}

\subsubsection{Macro Basics}
\label{sec:org20cc8cc}

\subsubsection{Quasiquotation}
\label{sec:orgf5b9097}

\subsubsection{Variable Capture and \texttt{gensym}}
\label{sec:org76c455d}
\end{document}